## import numpy as np
import pandas as pd

In [3]:
dataset = {
        "Departman":["Bilişim","İnsan Kaynakları","Üretim","Üretim","Bilişim","İnsan Kaynakları"],
        "Çalışan": ["Mustafa","Jale","Kadir","Zeynep","Murat","Ahmet"],
        "Maaş":[3000,3500,2500,4500,4000,2000]
        }

In [4]:
dataset

{'Departman': ['Bilişim',
  'İnsan Kaynakları',
  'Üretim',
  'Üretim',
  'Bilişim',
  'İnsan Kaynakları'],
 'Çalışan': ['Mustafa', 'Jale', 'Kadir', 'Zeynep', 'Murat', 'Ahmet'],
 'Maaş': [3000, 3500, 2500, 4500, 4000, 2000]}

In [5]:
df=pd.DataFrame(dataset)

In [6]:
df

          Departman  Çalışan  Maaş
0           Bilişim  Mustafa  3000
1  İnsan Kaynakları     Jale  3500
2            Üretim    Kadir  2500
3            Üretim   Zeynep  4500
4           Bilişim    Murat  4000
5  İnsan Kaynakları    Ahmet  2000

In [7]:
DepGroup=df.groupby("Departman")

In [8]:
DepGroup

In [9]:
DepGroup.sum()

C:\Users\ihaka\AppData\Local\Temp\ipykernel_20784\802905947.py:1: FutureWarning: The default value of numeric_only in DataFrameGroupBy.sum is deprecated. In a future version, numeric_only will default to False. Either specify numeric_only or select only columns which should be valid for the function.
  DepGroup.sum()

                  Maaş
Departman
Bilişim           7000
Üretim            7000
İnsan Kaynakları  5500

In [11]:
df.groupby("Departman").sum()  #Kısa işlem olarak yapılabilir

C:\Users\ihaka\AppData\Local\Temp\ipykernel_20784\2501934581.py:1: FutureWarning: The default value of numeric_only in DataFrameGroupBy.sum is deprecated. In a future version, numeric_only will default to False. Either specify numeric_only or select only columns which should be valid for the function.
  df.groupby("Departman").sum()  #Kısa işlem olarak yapılabilir

                  Maaş
Departman
Bilişim           7000
Üretim            7000
İnsan Kaynakları  5500

In [14]:
df.groupby("Departman").sum().loc["Bilişim"]

C:\Users\ihaka\AppData\Local\Temp\ipykernel_20784\274543488.py:1: FutureWarning: The default value of numeric_only in DataFrameGroupBy.sum is deprecated. In a future version, numeric_only will default to False. Either specify numeric_only or select only columns which should be valid for the function.
  df.groupby("Departman").sum().loc["Bilişim"]

Maaş    7000
Name: Bilişim, dtype: int64

In [15]:
int(df.groupby("Departman").sum().loc["Bilişim"])

C:\Users\ihaka\AppData\Local\Temp\ipykernel_20784\1179706538.py:1: FutureWarning: The default value of numeric_only in DataFrameGroupBy.sum is deprecated. In a future version, numeric_only will default to False. Either specify numeric_only or select only columns which should be valid for the function.
  int(df.groupby("Departman").sum().loc["Bilişim"])

7000

In [18]:
df.groupby("Departman").count() #Her bir departmanda çalışan toplam insan sayısını gösterir

                  Çalışan  Maaş
Departman
Bilişim                 2     2
Üretim                  2     2
İnsan Kaynakları        2     2

In [19]:
df

          Departman  Çalışan  Maaş
0           Bilişim  Mustafa  3000
1  İnsan Kaynakları     Jale  3500
2            Üretim    Kadir  2500
3            Üretim   Zeynep  4500
4           Bilişim    Murat  4000
5  İnsan Kaynakları    Ahmet  2000

In [22]:
df.groupby("Departman").max()  #Aynı departmanda olanlardan maaşı yüksek olan ve ismi alfabetik sırayla sonra gelen yazdırılır.
                            #Normalde 4000 maaşı Murat a ait ama max() komutu gereği Çalışan kolonunu da alfabetik olarak sıralayıp yazdırıyor...

                  Çalışan  Maaş
Departman
Bilişim           Mustafa  4000
Üretim             Zeynep  4500
İnsan Kaynakları     Jale  3500

In [24]:
df.groupby("Departman").min() #Burada departmanlara göre maaşı en düşük olan ve çalışan ismi alfabede önce gelenler sıralanır.

                 Çalışan  Maaş
Departman
Bilişim            Murat  3000
Üretim             Kadir  2500
İnsan Kaynakları   Ahmet  2000

In [26]:
df.groupby("Departman").min()["Maaş"]

Departman
Bilişim             3000
Üretim              2500
İnsan Kaynakları    2000
Name: Maaş, dtype: int64

In [28]:
df.groupby("Departman").min()["Maaş"]["Bilişim"]

3000

In [29]:
df.groupby("Departman").mean()

C:\Users\ihaka\AppData\Local\Temp\ipykernel_20784\2086239035.py:1: FutureWarning: The default value of numeric_only in DataFrameGroupBy.mean is deprecated. In a future version, numeric_only will default to False. Either specify numeric_only or select only columns which should be valid for the function.
  df.groupby("Departman").mean()

                    Maaş
Departman
Bilişim           3500.0
Üretim            3500.0
İnsan Kaynakları  2750.0

In [30]:
df.groupby("Departman").mean()["Maaş"]["İnsan Kaynakları"]

C:\Users\ihaka\AppData\Local\Temp\ipykernel_20784\1813376627.py:1: FutureWarning: The default value of numeric_only in DataFrameGroupBy.mean is deprecated. In a future version, numeric_only will default to False. Either specify numeric_only or select only columns which should be valid for the function.
  df.groupby("Departman").mean()["Maaş"]["İnsan Kaynakları"]

2750.0

In [31]:
int(df.groupby("Departman").mean()["Maaş"]["İnsan Kaynakları"])

C:\Users\ihaka\AppData\Local\Temp\ipykernel_20784\3442096136.py:1: FutureWarning: The default value of numeric_only in DataFrameGroupBy.mean is deprecated. In a future version, numeric_only will default to False. Either specify numeric_only or select only columns which should be valid for the function.
  int(df.groupby("Departman").mean()["Maaş"]["İnsan Kaynakları"])

2750